# GetTypeName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetProperty..::..GetTypeName Method
AssetProperty Class See Also
---
Get the name of the AssetProperty
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static string GetTypeName(
	AssetPropertyType type
)
```

Visual Basic
---
```text
Public Shared Function GetTypeName ( _
	type As AssetPropertyType _
) As String
```

Visual C++
---
```text
public:
static String^ GetTypeName(
	AssetPropertyType type
)
```

# ### Parameters
type
    Type: Autodesk.Revit.DB.Visual..::..AssetPropertyType
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when type is AssetPropertyType::Unknown. |

# See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace